app/Models/ModelDownload.php

    public function AllData()
    {
        return $this->db->table('tbl_download')
            ->join('tbl_ebook', 'tbl_ebook.id_ebook = tbl_download.id_ebook')
            ->join('tbl_kategori', 'tbl_kategori.id_kategori = tbl_ebook.id_kategori') // FIX
            // ->join('tbl_pengunjung', 'tbl_pengunjung.id_pengunjung = tbl_download.id_pengunjung', 'left')
            ->select('tbl_download.*, tbl_ebook.judul_ebook, tbl_kategori.nama_kategori')
            ->orderBy('id_download', 'ASC')
            ->get()
            ->getResultArray();
---
SELECT `tbl_download`.*, `tbl_ebook`.`judul_ebook`, `tbl_kategori`.`nama_kategori`
FROM `tbl_download`
JOIN `tbl_ebook` ON `tbl_ebook`.`id_ebook` = `tbl_download`.`id_ebook`
JOIN `tbl_kategori` ON `tbl_kategori`.`id_kategori` = `tbl_ebook`.`id_kategori`
ORDER BY `tbl_download`.`id_download` DESC