app/Models/ModelEbook.php

    public function AllData()
    {
        return $this->db->table('tbl_ebook')
            ->join('tbl_kategori', 'tbl_kategori.id_kategori = tbl_ebook.id_kategori', 'left')
            ->join('tbl_penerbit', 'tbl_penerbit.id_penerbit = tbl_ebook.id_penerbit', 'left')
            ->join('tbl_pengarang', 'tbl_pengarang.id_pengarang = tbl_ebook.id_pengarang', 'left')
            ->join('tbl_user', 'tbl_user.id_user = tbl_ebook.id_user', 'left')
            ->select('
                tbl_ebook.*,
                tbl_user.nama_user,
                tbl_user.level,
                tbl_pengarang.nama_pengarang,
                tbl_penerbit.nama_penerbit,
                tbl_kategori.nama_kategori
            ')
            ->orderBy('id_ebook', 'DESC')
            ->get()->getResultArray();
---
SELECT `tbl_ebook`.*, `tbl_user`.`nama_user`, `tbl_user`.`level`, `tbl_pengarang`.`nama_pengarang`, `tbl_penerbit`.`nama_penerbit`, `tbl_kategori`.`nama_kategori`
FROM `tbl_ebook`
LEFT JOIN `tbl_kategori` ON `tbl_kategori`.`id_kategori` = `tbl_ebook`.`id_kategori`
LEFT JOIN `tbl_penerbit` ON `tbl_penerbit`.`id_penerbit` = `tbl_ebook`.`id_penerbit`
LEFT JOIN `tbl_pengarang` ON `tbl_pengarang`.`id_pengarang` = `tbl_ebook`.`id_pengarang`
LEFT JOIN `tbl_user` ON `tbl_user`.`id_user` = `tbl_ebook`.`id_user`
ORDER BY `id_ebook` DESC

    public function DetailData($id_ebook)
    {
        return $this->db->table('tbl_ebook')
            ->join('tbl_kategori', 'tbl_kategori.id_kategori = tbl_ebook.id_kategori', 'left')
            ->join('tbl_penerbit', 'tbl_penerbit.id_penerbit = tbl_ebook.id_penerbit', 'left')
            ->join('tbl_pengarang', 'tbl_pengarang.id_pengarang = tbl_ebook.id_pengarang', 'left')
            ->where('id_ebook', $id_ebook)
            ->get()->getRowArray();
---
SELECT *
FROM `tbl_ebook`
LEFT JOIN `tbl_kategori` ON `tbl_kategori`.`id_kategori` = `tbl_ebook`.`id_kategori`
LEFT JOIN `tbl_penerbit` ON `tbl_penerbit`.`id_penerbit` = `tbl_ebook`.`id_penerbit`
LEFT JOIN `tbl_pengarang` ON `tbl_pengarang`.`id_pengarang` = `tbl_ebook`.`id_pengarang`
WHERE `id_ebook` = '32'

    public function GrafikDownloadKategori($tgl_awal = null, $tgl_akhir = null)
    {
        $builder = $this->db->table('tbl_download');

        $builder->select('tbl_kategori.nama_kategori, COUNT(tbl_download.id_download) as total_download');

        $builder->join('tbl_ebook', 'tbl_ebook.id_ebook = tbl_download.id_ebook');
        $builder->join('tbl_kategori', 'tbl_kategori.id_kategori = tbl_ebook.id_kategori');

        // =============================
        // FILTER TANGGAL (BENAR)
        // =============================
        if (!empty($tgl_awal) && !empty($tgl_akhir)) {
            $builder->where('DATE(tbl_download.tgl_download) >=', $tgl_awal);
            $builder->where('DATE(tbl_download.tgl_download) <=', $tgl_akhir);
        }

        $builder->groupBy('tbl_kategori.id_kategori');

        return $builder->get()->getResultArray();
---
SELECT `tbl_kategori`.`nama_kategori`, COUNT(tbl_download.id_download) as total_download
FROM `tbl_download`
JOIN `tbl_ebook` ON `tbl_ebook`.`id_ebook` = `tbl_download`.`id_ebook`
JOIN `tbl_kategori` ON `tbl_kategori`.`id_kategori` = `tbl_ebook`.`id_kategori`
GROUP BY `tbl_kategori`.`id_kategori`