app/Models/ModelKelas.php

    public function AllData()
    {
        return $this->db->table('tbl_kelas')
            ->orderBy('id_kelas', 'ASC')
            ->get()
            ->getResultArray();
---
SELECT *
FROM `tbl_kelas`
ORDER BY `id_kelas` ASC