app/Models/ModelHistory.php

    public function AddData($data)
    {
        $this->db->table('tbl_melihat')->insert($data);
---
INSERT INTO `tbl_melihat` (`id_pengunjung`, `aktivitas`, `keyword`, `tgl_history`) VALUES ('4', 'Pencarian', 'burangir', '2026-07-21 07:03:26')

    public function TotalHistory()
    {
        return $this->db->table('tbl_melihat')->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `tbl_melihat`