app/Models/ModelPenerbit.php

    public function AllData()
    {
        return $this->db->table('tbl_penerbit')
            ->orderBy('nama_penerbit', 'ASC')
            ->get()->getResultArray();
---
SELECT *
FROM `tbl_penerbit`
ORDER BY `nama_penerbit` ASC