app/Models/ModelRak.php

SELECT *
FROM `tbl_rak`
ORDER BY `nama_rak` ASC
---
    public function AllData()
    {
        return $this->db->table('tbl_rak')
            ->orderBy('nama_rak','ASC')
            ->get()->getResultArray();