app/Models/ModelAdmin.php

    public function TotalBuku()
    {
        return $this->db->table('tbl_buku')->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `tbl_buku`

    public function TotalEbook()
    {
        return $this->db->table('tbl_ebook')->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `tbl_ebook`

    public function TotalPengunjung()
    {
        return $this->db->table('tbl_pengunjung')->countAll(); //countall digunakan untuk menghitung total, rumus dari dokumentasi codeigniter
---
SELECT COUNT(*) AS `numrows` FROM `tbl_pengunjung`