app/Models/ModelPengunjung.php

SELECT *
FROM `tbl_pengunjung`
LEFT JOIN `tbl_kelas` ON `tbl_kelas`.`id_kelas` = `tbl_pengunjung`.`id_kelas`
WHERE `tbl_pengunjung`.`id_pengunjung` = '1'
---
    public function ProfilePengunjung($id_pengunjung)
    {
        return $this->db->table('tbl_pengunjung')
            ->join('tbl_kelas', 'tbl_kelas.id_kelas = tbl_pengunjung.id_kelas', 'left')
            ->where('tbl_pengunjung.id_pengunjung', $id_pengunjung)
            ->get()
            ->getRowArray();

SELECT `tbl_pengunjung`.*, `tbl_kelas`.`nama_kelas`, `tbl_user`.`nama_user`
FROM `tbl_pengunjung`
LEFT JOIN `tbl_kelas` ON `tbl_kelas`.`id_kelas` = `tbl_pengunjung`.`id_kelas`
LEFT JOIN `tbl_user` ON `tbl_user`.`id_user` = `tbl_pengunjung`.`verifikasi`
ORDER BY `id_pengunjung` DESC
---
    public function AllData()
    {
        return $this->db->table('tbl_pengunjung')
            ->join('tbl_kelas', 'tbl_kelas.id_kelas = tbl_pengunjung.id_kelas', 'left')
            ->join('tbl_user', 'tbl_user.id_user = tbl_pengunjung.verifikasi', 'left')
            ->select('
            tbl_pengunjung.*,
            tbl_kelas.nama_kelas,
            tbl_user.nama_user,
            ')
            ->orderBy('id_pengunjung', 'DESC')
            ->get()->getResultArray();

SELECT *
FROM `tbl_pengunjung`
LEFT JOIN `tbl_kelas` ON `tbl_kelas`.`id_kelas` = `tbl_pengunjung`.`id_kelas`
WHERE `id_pengunjung` = '106'
---
    public function DetailData($id_pengunjung)
    {
        return $this->db->table('tbl_pengunjung')
            ->join('tbl_kelas', 'tbl_kelas.id_kelas = tbl_pengunjung.id_kelas', 'left')
            ->where('id_pengunjung', $id_pengunjung)
            ->get()->getRowArray();