app/Models/ModelPengarang.php

    public function AllData()
    {
        return $this->db->table('tbl_pengarang')
            ->orderBy('nama_pengarang','ASC')
            ->get()->getResultArray();
---
SELECT *
FROM `tbl_pengarang`
ORDER BY `nama_pengarang` ASC