app/Models/ModelAuth.php

SELECT *
FROM `tbl_pengunjung`
WHERE `email` = 'rika@gmail.com'
AND `password` = 'rika1234'
---
    public function LoginPengunjung($email, $password)
    {
        return $this->db->table('tbl_pengunjung')
            ->where([
                'email' => $email,
                'password' => $password,
            ])->get()->getRowArray();