app/Models/ModelBuku.php

SELECT *
FROM `tbl_buku`
ORDER BY `id_buku` DESC
 LIMIT 10
---
    public function BukuSlider()
    {
        return $this->db->table('tbl_buku')
            ->orderBy('id_buku', 'DESC')
            ->limit(10)
            ->get()
            ->getResultArray();