app/Models/ModelEbook.php

    public function AllData()
    {
        return $this->db->table('tbl_ebook')
            ->join('tbl_kategori', 'tbl_kategori.id_kategori = tbl_ebook.id_kategori', 'left')
            ->join('tbl_penerbit', 'tbl_penerbit.id_penerbit = tbl_ebook.id_penerbit', 'left')
            ->join('tbl_pengarang', 'tbl_pengarang.id_pengarang = tbl_ebook.id_pengarang', 'left')
            ->join('tbl_user', 'tbl_user.id_user = tbl_ebook.id_user', 'left')
            ->select('
                tbl_ebook.*,
                tbl_user.nama_user,
                tbl_user.level,
                tbl_pengarang.nama_pengarang,
                tbl_penerbit.nama_penerbit,
                tbl_kategori.nama_kategori
            ')
            ->orderBy('judul_ebook', 'ASC')
            ->get()->getResultArray();
---
SELECT `tbl_ebook`.*, `tbl_user`.`nama_user`, `tbl_user`.`level`, `tbl_pengarang`.`nama_pengarang`, `tbl_penerbit`.`nama_penerbit`, `tbl_kategori`.`nama_kategori`
FROM `tbl_ebook`
LEFT JOIN `tbl_kategori` ON `tbl_kategori`.`id_kategori` = `tbl_ebook`.`id_kategori`
LEFT JOIN `tbl_penerbit` ON `tbl_penerbit`.`id_penerbit` = `tbl_ebook`.`id_penerbit`
LEFT JOIN `tbl_pengarang` ON `tbl_pengarang`.`id_pengarang` = `tbl_ebook`.`id_pengarang`
LEFT JOIN `tbl_user` ON `tbl_user`.`id_user` = `tbl_ebook`.`id_user`
ORDER BY `judul_ebook` ASC