app/Views/v_template_admin.php

SELECT *
FROM `tbl_web`
WHERE `id_web` = 1
SELECT *
FROM `tbl_user`
WHERE `id_user` = '1'
---
    use App\Controllers\Admin;

    $db = \Config\Database::connect();
    $web = $db->table('tbl_web')
        ->where('id_web', 1)
        ->get()->getRowArray();

    $user = $db->table('tbl_user')
        ->where('id_user', session()->get('id_user'))
        ->get()->getRowArray();